app/models/state.rb

  def self.front_page
    State.all.first(6)
---
SELECT  "states".* FROM "states" ORDER BY "states"."id" ASC LIMIT $1  [["LIMIT", 6]]