app/models/unit.rb

  def self.liter
    Unit.find_by_name 'liter'
---
SELECT  "units".* FROM "units" WHERE "units"."name" = $1 LIMIT $2  [["name", "liter"], ["LIMIT", 1]]

  def self.gallon
    Unit.find_by_name 'gallon'
---
SELECT  "units".* FROM "units" WHERE "units"."name" = $1 LIMIT $2  [["name", "liter"], ["LIMIT", 1]]